#### terraform init: `success`
#### terraform plan: `success`
#### terraform validate: `success`

<details><summary>Show Plan</summary>

```

terraform
module.ecr.aws_ecr_repository.api: Refreshing state... [id=api]
module.s3.aws_s3_bucket.gs_web: Refreshing state... [id=staging.groundschool.co.nz]
module.iam.aws_iam_user.github_deployer: Refreshing state... [id=github_deployer]
module.iam.aws_iam_user_policy.github_deployer_policy: Refreshing state... [id=github_deployer:github_deployer_policy]
module.iam.aws_iam_access_key.github_deployer_access_key: Refreshing state... [id=AKIAW4GD2XMHWJW2VS42]
module.s3.aws_s3_bucket_acl.gs_web_acl: Refreshing state... [id=staging.groundschool.co.nz,public-read]
module.s3.aws_s3_bucket_website_configuration.gs_web_website_configuration: Refreshing state... [id=staging.groundschool.co.nz]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.s3-distribution will be created
  + resource "aws_cloudfront_distribution" "s3-distribution" {
      + aliases                        = [
          + "stage.groundschool.co.nz",
          + "www.stage.groundschool.co.nz",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Environment" = "staging"
        }
      + tags_all                       = {
          + "Environment" = "staging"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "stage.groundschool.co.nz-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "index.html"
          + target_origin_id       = "stage.groundschool.co.nz-origin"
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "stage.groundschool.co.nz-origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:246254583363:certificate/ab4875ce-78fd-494e-bae5-88ce0b28a40f"
          + minimum_protocol_version = "TLSv1.1_2016"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.dynamodb.aws_dynamodb_table.exam-questions-table will be created
  + resource "aws_dynamodb_table" "exam-questions-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "exam-questions"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "Environment" = "staging"
        }
      + write_capacity   = 1

      + attribute {
          + name = "examId"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "examId"
          + name               = "examIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 1
          + write_capacity     = 1
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.dynamodb.aws_dynamodb_table.exams-table will be created
  + resource "aws_dynamodb_table" "exams-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "exams"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "Environment" = "staging"
        }
      + write_capacity   = 1

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "licenseType"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "licenseType"
          + name               = "licenseTypeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 1
          + write_capacity     = 1
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.ecr.aws_ecr_repository.api will be destroyed
  # (because aws_ecr_repository.api is not in configuration)
  - resource "aws_ecr_repository" "api" {
      - arn                  = "arn:aws:ecr:ap-southeast-2:472857099023:repository/api" -> null
      - id                   = "api" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "api" -> null
      - registry_id          = "472857099023" -> null
      - repository_url       = "472857099023.dkr.ecr.ap-southeast-2.amazonaws.com/api" -> null
      - tags                 = {
          - "Environment" = "staging"
        } -> null
      - tags_all             = {
          - "Environment" = "staging"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # module.s3.aws_s3_bucket.gs_web must be replaced
-/+ resource "aws_s3_bucket" "gs_web" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::staging.groundschool.co.nz" -> (known after apply)
      ~ bucket                      = "staging.groundschool.co.nz" -> "stage.groundschool.co.nz" # forces replacement
      ~ bucket_domain_name          = "staging.groundschool.co.nz.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "staging.groundschool.co.nz.s3.ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1WCIGYICN2BYD" -> (known after apply)
      ~ id                          = "staging.groundschool.co.nz" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "staging"
        }
      ~ website_domain              = "s3-website-ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "staging.groundschool.co.nz.s3-website-ap-southeast-2.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "81a747d782aee22bfa674c3954b577a01a8e4848a75395edb2da70092f751340" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
          ~ error_document           = "error.html" -> (known after apply)
          ~ index_document           = "index.html" -> (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3.aws_s3_bucket_acl.gs_web_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "gs_web_acl" {
      ~ bucket = "staging.groundschool.co.nz" -> (known after apply) # forces replacement
      ~ id     = "staging.groundschool.co.nz,public-read" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "groundschoolnz+staging" -> null
                  - id           = "81a747d782aee22bfa674c3954b577a01a8e4848a75395edb2da70092f751340" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              ~ display_name = "groundschoolnz+staging" -> (known after apply)
              ~ id           = "81a747d782aee22bfa674c3954b577a01a8e4848a75395edb2da70092f751340" -> (known after apply)
            }
        }
    }

  # module.s3.aws_s3_bucket_website_configuration.gs_web_website_configuration must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "gs_web_website_configuration" {
      ~ bucket           = "staging.groundschool.co.nz" -> "stage.groundschool.co.nz" # forces replacement
      ~ id               = "staging.groundschool.co.nz" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "staging.groundschool.co.nz.s3-website-ap-southeast-2.amazonaws.com" -> (known after apply)

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @peterussell, Action: `pull_request`*